#pragma once
#include "title.h"

void wellcome_system_ui() {
	printf("**********************************************\n");
	printf("*********欢迎来到运动数据统计系统！***********\n");
	printf("**********************************************\n");
}

void close_system_ui() {
	printf("**********************************************");
	printf("**************欢迎下次继续使用****************");
	printf("**********************************************");
}

void main_system_ui() {
	puts("*************************************************");
	puts("*                1.显示所有收录信息           *");
	puts("*                2.增加信息录入               *");
	puts("*                3.查找信息                   *");
	puts("*                4.修改信息                   *");
	puts("*                5.退出管理系统               *");
	puts("***********************************************");
}

void display_all_ui() {
	printf("**********************************************");
	printf("\n   以下是所存储的全部信息，请查看！     \n");
}

void add_information_ui() {
	printf("**********************************************");
	printf("\n        接下来请输入待录入的信息！        \n");
}

void find_information_ui() {
	printf("**********************************************");
	printf("             查找信息功能页面              \n\n");
	printf("             1. 按照姓名进行查找           \n\n");
	printf("             2. 返回上一个界面             \n\n");
	printf("**********************************************");
}

void revise_information_ui() {
	printf("**********************************************");
	printf("             修改信息功能页面              \n\n");
	printf("             1. 按照姓名进行修改           \n\n");
	printf("             2. 返回上一个界面             \n\n");
	printf("**********************************************");
}